ahmadafkandeh/MicroGUI/GUI/Driver/Drivers/LPC17xx/DisplayDriver/TFT3inc/lcd.cpp
void LCD_DisplayChar (unsigned int ln, unsigned int col, unsigned char c) 
{
  c -= 32;
  LCD_DrawChar(col * CHAR_W, ln * CHAR_H, (unsigned short *)&Font_24x16[c * CHAR_H]);
}


/*******************************************************************************
* Disply string on given line                                                  *
*   Parameter:      ln:       line number                                      *
*                   col:      column number                                    *
*                   s:        pointer to string                                *
*   Return:                                                                    *
*******************************************************************************/

void LCD_DisplayString (unsigned int ln, unsigned int col, unsigned char *s) 
{
  LCD_WindowMax(0,0,240,320);
  while (*s) 
  {
    LCD_DisplayChar(ln, col++, *s++);
  }
}


/*******************************************************************************
* Clear given line                                                             *
*   Parameter:      ln:       line number                                      *
*   Return:                                                                    *
*******************************************************************************/

void LCD_ClearLn (unsigned int ln) 
{
  unsigned char Buff[25]="                    ";
	LCD_WindowMax(0,0,240,320);
	
  LCD_DisplayString(ln, 0,Buff);
}

/*******************************************************************************
* Draw bargraph                                                                *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        maximum width of bargraph (in pixels)            *
*                   val:      value of active bargraph (in 1/1024)             *
*   Return:                                                                    *
*******************************************************************************/

void LCD_Bargraph (unsigned int x, unsigned int y, unsigned int w, unsigned int h, unsigned int val) 
{
  int i,j;

  x = WIDTH-x-w;
  wr_reg(0x50, y);                      /* Horizontal GRAM Start Address      */
  wr_reg(0x51, y+CHAR_H-1);             /* Horizontal GRAM End   Address (-1) */
  wr_reg(0x52, x);                      /* Vertical   GRAM Start Address      */
  wr_reg(0x53, x+w-1);                  /* Vertical   GRAM End   Address (-1) */

  val = (val * w) >> 10;                /* Scale value for 24x12 characters   */
  LCD_SetCursor(0,0);
  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat_start();
  for (i = 0; i < h; i++) {
    for (j = w-1; j >= 0; j--) {
      if(j >= val) {
        wr_dat_only(BackColor);
      } else {
        wr_dat_only(TextColor);
      }
    }
  }
  wr_dat_stop();
}
/*******************************************************************************
* Display graphical bmp file image at position x horizontally and y vertically *
* (This function is optimized for 16 bits per pixel format, it has to be       *
*  adapted for any other bits per pixel format)                                *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        width of bitmap                                  *
*                   h:        height of bitmap                                 *
*                   bmp:      address at which the bmp data resides            *
*   Return:                                                                    *
*******************************************************************************/

void LCD_Bmp (unsigned int x, unsigned int y, unsigned int w, unsigned int h, unsigned char *bmp) 
{
  unsigned int    i, j;
  unsigned short *bitmap_ptr = (unsigned short *)bmp;

  LCD_WindowMax(x,y,x+w,y+h);
  LCD_SetCursor(x,y);

  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat_start();
 // bitmap_ptr += (h*w)-1;
  for (j = 0; j < h; j++) {
    for (i = 0; i < w; i++) {
      wr_dat_only(*bitmap_ptr++);
    }
  }
  wr_dat_stop();
}
/******************************************************************************/

 
/*
*********************************************************************************************************
* Description: 	Write start GRAM Command
* Arguments  : 	None
* Returns    : 	None
*********************************************************************************************************
*/
void LCD_WriteRAM_Prepare(void)
{
	wr_cmd(R34);
}
/*
*********************************************************************************************************
* Description: 	In designated areas within the specified color display 
* Arguments  : 	(xsta ,ysta) start coordinate
*				(xend ,yend) end   coordinate
*				color        I don't know  (ˇ-ˇ）
* Returns    : 	None
*********************************************************************************************************
*/
void LCD_Fill(u8 xsta,u16 ysta,u8 xend,u16 yend,u16 color)
{       

  unsigned int    i, j;
  LCD_WindowMax(xsta,ysta,xsta+xend,ysta+yend);
  LCD_SetCursor(xsta,ysta);

  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat_start();
  for (j = 0; j < yend; j++) {
    for (i = 0; i < xend; i++)
      wr_dat_only(color);
  }
  wr_dat_stop();	
//     u32 n;
// 	/*设置窗口*/										
// 	wr_reg(R80, xsta); 							/*水平方向GRAM起始地址*/
// 	wr_reg(R81, xend); 							/*水平方向GRAM结束地址*/
// 	wr_reg(R82, ysta); 							/*垂直方向GRAM起始地址*/
// 	wr_reg(R83, yend); 							/*垂直方向GRAM结束地址*/	
// 	LCD_SetCursor(xsta,ysta);					/*设置光标位置		  */
//   LCD_CS(0)	  
// 	LCD_WriteRAM_Prepare();  					/*开始写入GRAM		  */
//   wr_dat_start();	 	   	   
// 	n=(u32)(yend-ysta+1)*(xend-xsta+1);    
// 	while(n--){wr_dat_only(color);}				/*显示所填充的颜色.   */
// 	/*恢复设置*/
// 	wr_reg(R80, 0x0000); 						/*水平方向GRAM起始地址*/
// 	wr_reg(R81, 0x00EF); 						/*水平方向GRAM结束地址*/
// 	wr_reg(R82, 0x0000); 						/*垂直方向GRAM起始地址*/
// 	wr_reg(R83, 0x013F); 						/*垂直方向GRAM结束地址*/	    
} 
/*
*********************************************************************************************************
* Description: 	DrawPoint or white
* Arguments  : 	(x ,y) The coordinate
* Returns    : 	None
*********************************************************************************************************
*/
void LCD_DrawPoint (u16 x,u16 y ,u16 color) 
{

  LCD_WindowMax(0,0,240,320);

