ahmadafkandeh/MicroGUI/GUI/Driver/Drivers/LPC17xx/DisplayDriver/TFT3inc/lcd.cpp
  LCD_SetCursor(x,y);
  LCD_CS(0)
  wr_cmd(0x22);
  wr_dat_start();
  wr_dat_only(color);
  wr_dat_stop();
}
/*
*********************************************************************************************************
* Description: 	Draw lines 
* Arguments  : 	(x1 ,y1) start coordinate
*				(x2 ,y2) end   coordinate
* Returns    : 	None
*********************************************************************************************************
*/ 
void LCD_DrawLine(u8 x1, u16 y1, u8 x2, u16 y2)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 

	delta_x=x2-x1; 											/*计算坐标增量		*/ 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1; 
	if(delta_x>0)incx=1; 									/*设置单步方向		*/ 
	else if(delta_x==0)incx=0;								/*垂直线 	  		*/
	else {incx=-1;delta_x=-delta_x;} 
	if(delta_y>0)incy=1; 
	else if(delta_y==0)incy=0;								/*水平线 	  		*/
	else{incy=-1;delta_y=-delta_y;} 
	if( delta_x>delta_y)distance=delta_x; 					/*选取基本增量坐标轴*/ 
	else distance=delta_y; 
	for(t=0;t<=distance+1;t++ )								/*画线输出 			*/
	{  
		LCD_DrawPoint(uRow,uCol,POINT_COLOR);							/*画点 				*/
		xerr+=delta_x ;
		yerr+=delta_y ;
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}   
/*
*********************************************************************************************************
* Description: 	Draw rectanguar 
* Arguments  : 	(x1 ,y1) (x2 ,y2) The diagonal Level vertical 
* Returns    : 	None
*********************************************************************************************************
*/ 
void LCD_DrawRectangle(u8 x1, u16 y1, u8 x2, u16 y2)
{
	LCD_DrawLine(x1,y1,x2,y1);
	LCD_DrawLine(x1,y1,x1,y2);
	LCD_DrawLine(x1,y2,x2,y2);
	LCD_DrawLine(x2,y2,x2,y1);
}

/*
*********************************************************************************************************
* Description: 	In designated areas within the specified circle 
* Arguments  : 	(x0 ,y0) center coordinate
*				 r       radius coordinate
* Returns    : 	None
*********************************************************************************************************
*/
void Draw_Circle(u8 x0,u16 y0,u8 r)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             								/*判断下个点位置的标志*/
	while(a<=b)
	{
		LCD_DrawPoint(x0-b,y0-a,POINT_COLOR);                 
		LCD_DrawPoint(x0+b,y0-a,POINT_COLOR);                    
		LCD_DrawPoint(x0-a,y0+b,POINT_COLOR);                
		LCD_DrawPoint(x0-b,y0-a,POINT_COLOR);                    
		LCD_DrawPoint(x0-a,y0-b,POINT_COLOR);                    
		LCD_DrawPoint(x0+b,y0+a,POINT_COLOR);                      
		LCD_DrawPoint(x0+a,y0-b,POINT_COLOR);          
		LCD_DrawPoint(x0+a,y0+b,POINT_COLOR);          
		LCD_DrawPoint(x0-b,y0+a,POINT_COLOR);             
		a++;
		/*使用Bresenham算法画圆*/    
		if(di<0)di +=4*a+6;	  
		else
		{
			di+=10+4*(a-b);   
			b--;
		} 
		LCD_DrawPoint(x0+a,y0+b,POINT_COLOR);
	}
} 

/*
*********************************************************************************************************
* Description: 	In designated areas within the specified character 
* Arguments  : 	(x0 ,y0) The coordinate
*				 num     The value
*				size     size (16 or 12)
*               mode     superposition(1) or not 0
* Returns    : 	None
*********************************************************************************************************
*/
void LCD_ShowChar(u8 x,u16 y,u8 num,u8 size,u8 mode)
{       
#define MAX_CHAR_POSX 232
#define MAX_CHAR_POSY 304 
    u8 temp;
    u8 pos,t;      
    if(x>MAX_CHAR_POSX||y>MAX_CHAR_POSY)return;	    									
	wr_reg(R80,x);           							/*水平方向GRAM起始地址 */
	wr_reg(R81,x+(size/2-1));							/*水平方向GRAM结束地址 */
	wr_reg(R82,y);           							/*垂直方向GRAM起始地址 */
	wr_reg(R83,y+size-1);    							/*垂直方向GRAM结束地址 */	
	LCD_SetCursor(x,y);            						/*设置光标位置  	   */
	LCD_WriteRAM_Prepare();        						/*开始写入GRAM	   	   */
	num=num-' ';										/*得到偏移后的值	   */
	if(!mode) 											/*非叠加方式		   */
	{
		for(pos=0;pos<size;pos++)
		{
			if(size==12)temp=asc2_1206[num][pos];
			else temp=asc2_1608[num][pos];		 
			for(t=0;t<size/2;t++)
		    {                 
		        if(temp&0x01)
				{
       				LCD_DrawPoint(x+t,y+pos,TextColor);
				}
// 				else
// 				{
//        	LCD_DrawPoint(x+t,y+pos,BackColor);			
// 				}
				// wr_dat(BACK_COLOR);	        
		        temp>>=1; 
		    }
		}	
	}else												/*叠加方式   */
	{
		for(pos=0;pos<size;pos++)
		{
			if(size==12)temp=asc2_1206[num][pos];		/*调用1206字体*/
			else temp=asc2_1608[num][pos];		 		/*调用1608字体*/
			for(t=0;t<size/2;t++)
		    {                 
		        if(temp&0x01)LCD_DrawPoint(x+t,y+pos,TextColor);	/*画一个点*/     
		        temp>>=1; 
		    }
		}
	}	    
	/*恢复窗体大小*/	 
	wr_reg(R80, 0x0000); 								/*水平方向GRAM起始地址*/
	wr_reg(R81, 0x00EF); 								/*水平方向GRAM结束地址*/
	wr_reg(R82, 0x0000); 								/*垂直方向GRAM起始地址*/
	wr_reg(R83, 0x013F); 								/*垂直方向GRAM结束地址*/
}
  
/*
*********************************************************************************************************
* Description: 	m^n function
* Arguments  : 	m n
* Returns    : 	None
*********************************************************************************************************
*/
u32 mypow(u8 m,u8 n)
{
	u32 result=1;	 
	while(n--)result*=m;    
	return result;
}	

/*
*********************************************************************************************************
* Description: 	Show num (from 0 to 4294967295)
* Arguments  : 	(x ,y) The coordinate
*				 num     The value
*				 len	 The number of num
*				size     size (16 or 12)
* Returns    : 	None
*********************************************************************************************************
*/	 
void LCD_ShowNum(u8 x,u16 y,u32 num,u8 len,u8 size)
{         	
	u8 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/mypow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				LCD_ShowChar(x+(size/2)*t,y,' ',size,1);
				continue;
			}else enshow=1; 
		 	 
